simple_test_model/simulation_data/refCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   2000;

// purgeWrite      10;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // wallyPlus
	// {
	// 	type            yPlus;
	// 	libs            ("libfieldFunctionObjects.so");

	// 	executeControl  onEnd;
	// 	writeControl    onEnd;
	// }

    // #include "../postProcessingDict/includeFile"

    // solverInfo
    // {
    //     type            solverInfo;
    //     libs            ("libutilityFunctionObjects.so");
    //     fields          (U p k omega);
    //     // writeResidualFields yes;
    //     // writeTime       1;
    // }

    // avgOutlets
    // {
    //     name            avgOutlets;
    //     type            surfaceFieldValue;
    //     libs            (fieldFunctionObjects);
    //     enabled         yes;
    //     // writeControl    writeTime;
    //     log             yes;
    //     writeFields     off;
    //     surfaceFormat   vtk;
    //     regionType      patch;
    //     names           ("Block.*_top");
    //     operation       areaAverage;
    //     // weightField     phi;
    //     fields
    //     (
    //         U
    //     );
    // }
}


// ************************************************************************* //
