simple_test_model/simulation_data/refCase/system/MomentumSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      DFmodelDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rodD            8.2e-3;
wireD           2.2e-3;
wireH           300.0e-3;
rodCentroids    ((0 0 0)
                (10.49e-3 0 0)
                (-10.49e-3 0 0)
                (5.245e-3 9.0849e-3 0)
                (-5.245e-3 9.0849e-3 0)
                (5.245e-3 -9.0849e-3 0)
                (-5.245e-3 -9.0849e-3 0));

fConst          3.0;
fCoeff          0.02066;

// ************************************************************************* //